# ðŸ“Œ Project Summary

This script reads raw sales data and automatically generates:
- A summary of revenue, orders, and units sold
- Weekly sales breakdown
- Excel charts (bar/line) for quick insights

### ðŸ›  Tools: Python, Pandas, openpyxl

# ðŸ“¥ Step 1: Load Sales Data

## Reading Data From an Excel File

First of all, we will read the data from an excel file using <span style="color:blue">'pandas'</span> module. With the help of <span style="color:red">read_excel()</span> or <span style="color:red">read_csv()</span> method, we can read the Excel File.

In [1]:
import pandas as pd
sales_data = pd.read_csv('ecommerce_sales_data.csv')

In [2]:
sales_data

,Date,Order ID,Customer ID,Region,Product,Category,Units Sold,Unit Price
0,2025-05-12,ORD10000,CUST2203,South,Microwave,Home Appliances,5,150
1,2025-05-07,ORD10001,CUST9564,North,Tablet,Electronics,6,499
2,2025-05-29,ORD10002,CUST1272,North,Jacket,Clothing,2,75
3,2025-05-08,ORD10003,CUST2761,South,Smartphone,Electronics,9,699
4,2025-05-21,ORD10004,CUST5135,South,Jacket,Clothing,1,75
...,...,...,...,...,...,...,...,...
995,2025-05-29,ORD10995,CUST8312,East,Smartphone,Electronics,1,699
996,2025-05-17,ORD10996,CUST2411,East,Jacket,Clothing,10,75
997,2025-05-30,ORD10997,CUST2671,South,Microwave,Home Appliances,10,150
998,2025-05-22,ORD10998,CUST8956,North,T-shirt,Clothing,7,25
999,2025-05-16,ORD10999,CUST4060,East,Blender,Home Appliances,7,89

Here, you can see that there are total of 8 columns and 1000 rows. It means there are total of 1000 data entries in 8 field such as
Date, Order ID, Customer ID, Region, Product, Category, Units Sold and Unit Price.

Now, Let's add another column which shows the sales per order. And that will be the **'Total Units Sold x Unit Price'**

For adding a column, we can use <span style="color:red">insert()</span> method of dataframe object. We want to insert the column
at **8th** index. And we'll name the column *'Revenue'*.

In [3]:
rev = sales_data['Units Sold'] * sales_data['Unit Price']
sales_data.insert(8,'Revenue',rev)

In [4]:
sales_data

,Date,Order ID,Customer ID,Region,Product,Category,Units Sold,Unit Price,Revenue
0,2025-05-12,ORD10000,CUST2203,South,Microwave,Home Appliances,5,150,750
1,2025-05-07,ORD10001,CUST9564,North,Tablet,Electronics,6,499,2994
2,2025-05-29,ORD10002,CUST1272,North,Jacket,Clothing,2,75,150
3,2025-05-08,ORD10003,CUST2761,South,Smartphone,Electronics,9,699,6291
4,2025-05-21,ORD10004,CUST5135,South,Jacket,Clothing,1,75,75
...,...,...,...,...,...,...,...,...,...
995,2025-05-29,ORD10995,CUST8312,East,Smartphone,Electronics,1,699,699
996,2025-05-17,ORD10996,CUST2411,East,Jacket,Clothing,10,75,750
997,2025-05-30,ORD10997,CUST2671,South,Microwave,Home Appliances,10,150,1500
998,2025-05-22,ORD10998,CUST8956,North,T-shirt,Clothing,7,25,175
999,2025-05-16,ORD10999,CUST4060,East,Blender,Home Appliances,7,89,623

# ðŸ“Š Step 2: Generate Summary

## Calculating Monthly Sales

Now, we'll convert the date from the dataframe into the datetime object, so that we can access the month from the date easily.

In [5]:
sales_data['Date'][0]

'2025-05-12'

Here, you can see that it is already in datetime format. So, just in case if the date is stored in string format then we will use <span style="color:red">to_datetime()</span> method of pandas library to convert the dataframe object into *datetime* object.

In [6]:
sales_data['Date'] = pd.to_datetime(sales_data['Date']).dt.date
sales_data['Date'][0]

datetime.date(2025, 5, 12)

After that, you can check that it is converted into datetime object. Using the <span style="color:red">groupby()</span> function we can 
calculate the monthly revenue generated.

In [7]:
monthly_sales = sales_data.groupby(lambda x: sales_data['Date'][x].month).Revenue.sum()
monthly_sales

5    1337398
Name: Revenue, dtype: int64

In [8]:
print(f'Revenue: ${rev.tolist()[0]}')

Revenue: $750

So, total of *$13,37,398* revenue generated in the **5th(May)** month.

## Sales by Product, Region & Category

For calculating Sales by Product, we will use the <span style="color:red">groupby()</span> function to make a table which
contains Product name, Units Sold, Unit Price and Revenue.

In [9]:
sales_data[['Product','Units Sold','Unit Price','Revenue']]

        Product  Units Sold  Unit Price  Revenue
0     Microwave           5         150      750
1        Tablet           6         499     2994
2        Jacket           2          75      150
3    Smartphone           9         699     6291
4        Jacket           1          75       75
..          ...         ...         ...      ...
995  Smartphone           1         699      699
996      Jacket          10          75      750
997   Microwave          10         150     1500
998     T-shirt           7          25      175
999     Blender           7          89      623

[1000 rows x 4 columns]

So, our table contains these specific columns, which will make easier for us to see the total revenue generate by each product.

In [10]:
product_sales = sales_data.groupby('Product').agg({
    "Units Sold": "sum",
    "Unit Price": "first",
    "Revenue": "sum"
}).reset_index()

In [11]:
product_sales

            Product  Units Sold  Unit Price  Revenue
0     Action Figure         380          30    11400
1   Air Conditioner         331         399   132069
2           Blender         572          89    50908
3        Board Game         537          40    21480
4            Jacket         460          75    34500
5             Jeans         443          50    22150
6            Laptop         430         999   429570
7         Microwave         487         150    73050
8            Puzzle         466          20     9320
9        Smartphone         410         699   286590
10          T-shirt         395          25     9875
11           Tablet         514         499   256486

Here, we have created a table which shows us the revenue generated by each product. <br>
Similarly, We can also calculate revenue generated by each region & category.

In [12]:
region_sales = sales_data.groupby('Region').agg({
    "Units Sold": "sum",
    "Unit Price": "first",
    "Revenue": "sum"
}).reset_index()

In [13]:
region_sales

  Region  Units Sold  Unit Price  Revenue
0   East        1543          40   402162
1  North        1305         499   270592
2  South        1181         150   298314
3   West        1396          25   366330

In [14]:
category_sales = sales_data.groupby('Category').agg({
    "Units Sold": "sum",
    "Unit Price": "first",
    "Revenue": "sum"
}).reset_index()

In [15]:
category_sales

          Category  Units Sold  Unit Price  Revenue
0         Clothing        1298          75    66525
1      Electronics        1354         499   972646
2  Home Appliances        1390         150   256027
3             Toys        1383          30    42200

We've Covered the *'Sales done in each month'*, *'Sales by each product'*, *'Sales by each Region'*, *'Sales by each Category'*.

## Getting Revenue by Week

Let's begin by calculating how many total orders are there in a month & how many total units sold.

In [16]:
df_summary = pd.DataFrame([{"Total Revenue": sales_data["Revenue"].sum(),
                            "Total Order": sales_data["Order ID"].count(),
                            "Total Units Sold": sales_data["Units Sold"].sum()}])

In [17]:
df_summary

   Total Revenue  Total Order  Total Units Sold
0        1337398         1000              5425

Now, let's get sales by week in the month. For doing so, we'll use the <span style="color:red">isocalender()</span> method from the
**datetime** Library.

In [18]:
from datetime import datetime

def get_week_of_month(date):
    first_day_of_month = date.replace(day=1)
    week_number = date.isocalendar()[1] - first_day_of_month.isocalendar()[1] + 1
    return week_number

In [19]:
sales_data['Week'] = sales_data['Date'].apply(get_week_of_month)

In [20]:
sales_data

,Date,Order ID,Customer ID,Region,Product,Category,Units Sold,Unit Price,Revenue,Week
0,2025-05-12,ORD10000,CUST2203,South,Microwave,Home Appliances,5,150,750,3
1,2025-05-07,ORD10001,CUST9564,North,Tablet,Electronics,6,499,2994,2
2,2025-05-29,ORD10002,CUST1272,North,Jacket,Clothing,2,75,150,5
3,2025-05-08,ORD10003,CUST2761,South,Smartphone,Electronics,9,699,6291,2
4,2025-05-21,ORD10004,CUST5135,South,Jacket,Clothing,1,75,75,4
...,...,...,...,...,...,...,...,...,...,...
995,2025-05-29,ORD10995,CUST8312,East,Smartphone,Electronics,1,699,699,5
996,2025-05-17,ORD10996,CUST2411,East,Jacket,Clothing,10,75,750,3
997,2025-05-30,ORD10997,CUST2671,South,Microwave,Home Appliances,10,150,1500,5
998,2025-05-22,ORD10998,CUST8956,North,T-shirt,Clothing,7,25,175,4
999,2025-05-16,ORD10999,CUST4060,East,Blender,Home Appliances,7,89,623,3

Here, you can see that the Week column is added to the last column saying the which number of week from the date.<br>
Now, let's see the sales weekly.

In [21]:
df_week = sales_data.groupby('Week')['Revenue'].sum().reset_index()
df_week

   Week  Revenue
0     1   186042
1     2   345674
2     3   287125
3     4   302749
4     5   215808

In [22]:
weekly_sales = df_week.set_index('Week').T
weekly_sales

Week          1       2       3       4       5
Revenue  186042  345674  287125  302749  215808

In [23]:
weekly_sales.columns = [f"Week-{int(week)}" for week in weekly_sales.columns]
weekly_sales = weekly_sales.reset_index(drop=True)

In [24]:
weekly_sales

   Week-1  Week-2  Week-3  Week-4  Week-5
0  186042  345674  287125  302749  215808

Here, We used the Transposing to convert the dataframe from vertically to horizontally. 
Because It'll be easy to read and store in the excel file

# ðŸ“ˆ Step 3: Format Excel & Create Charts with openpyxl

## Creating the Excel Report

Now, let's create the styled excel report using **'openpyxl'** library. Using this library, we'll automate the excel report.

In [25]:
date_obj = sales_data['Date'][0].strftime("%b-%y")
date_obj

'May-25'

In [26]:
char_list = [chr(i) for i in range(65,80)]
char_list

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O']

In [27]:
def set_column_width(sheet):
    for letter in char_list:
        sheet.column_dimensions[letter].width = 22

In [28]:
import openpyxl
from openpyxl.styles import Font,Alignment,PatternFill

#create a new workbook
wb = openpyxl.Workbook()
ws = wb.active
ws.title = date_obj

set_column_width(ws)

ws.row_dimensions[1].height = 45
ws.merge_cells('A1:I1')
merged_cell = ws['A1']
merged_cell.alignment = Alignment(horizontal='left',vertical='center')
merged_cell.value = 'MONTHLY RETAIL SALES SUMMARY REPORT'
merged_cell.font = Font('Century Gothic',bold=True,size=22,color='595959')

ws.row_dimensions[2].height = 20
ws['A2'].alignment = Alignment(horizontal='left',vertical='center')
ws['A2'].value = 'REPORTING MONTH'
ws['A2'].font = Font('Century Gothic',bold=False,size=15,color='595959')

ws.row_dimensions[4].height = 40
ws.merge_cells('A4:F4')
merged_cell2 = ws['A4']
merged_cell2.alignment = Alignment(horizontal='left',vertical='center')
merged_cell2.value = date_obj
merged_cell2.font = Font('Century Gothic',bold=True,size=12,color='595959')
merged_cell2.fill = PatternFill(start_color="F2F2F2",fill_type="solid")

ws.row_dimensions[3].height = 3
ws.row_dimensions[5].height = 3

ws.row_dimensions[6].height = 35
ws.merge_cells('A6:C6')
merged_cell = ws['A6']
merged_cell.alignment = Alignment(horizontal='left',vertical='center')
merged_cell.value = 'SUMMARY REPORT'
merged_cell.font = Font('Century Gothic',bold=False,size=20,color='548235')

# wb.save('Excel_Report_Generator.xlsx')

## Adding DataFrame to Excel

To apply borders to the cell, we use <span style="color:red">Border</span> & <span style="color:red">Side</span> class from the
**openpyxl** library.

In [29]:
from openpyxl.styles.borders import Border,Side

def apply_Border_to_DataFrame(cell):
    cell.border = Border(left=Side(style='thin',color='BFBFBF'), 
                             right=Side(style='thin',color='BFBFBF'), 
                             top=Side(style='thin',color='BFBFBF'), 
                             bottom=Side(style='thin',color='BFBFBF'))

To Convert the add the dataframe into the excel file, there is one method we can use <span style="color:red">dataframe_to_rows</span>, which
converts the dataframe into rows and we can easily assign it in cells.

In [30]:
from openpyxl.utils.dataframe import dataframe_to_rows

def add_df_to_excel(sheet,rows,r_index,c_index,isHidden):
    for r_idx,row in enumerate(rows,r_index):
        for c_idx,value in enumerate(row,c_index):
            cell = sheet.cell(row=r_idx, column=c_idx, value=value)
            cell.alignment = Alignment(horizontal="center",vertical="center")
            cell.font = Font('Century Gothic',bold=False,size=12)
            if isHidden:
                cell.font = Font(color="FFFFFF")
            else:
                apply_Border_to_DataFrame(cell)  
                if cell.row == r_index:
                    cell.fill = PatternFill(start_color="E2EFDA",fill_type="solid")
                    cell.font = Font('Century Gothic',bold=True,size=11) 

        ws.row_dimensions[r_idx].height = 35

In [31]:
df_summary

   Total Revenue  Total Order  Total Units Sold
0        1337398         1000              5425

In [32]:
from openpyxl.utils import get_column_letter
from openpyxl.styles import numbers

ws.row_dimensions[7].height = 35
ws.row_dimensions[8].height = 35

rows_summary = dataframe_to_rows(df_summary,index=False)
add_df_to_excel(ws,rows_summary,7,1,isHidden=False)

for row in ws.iter_rows(min_row=7,max_row=8,min_col=1,max_col=3):
    for cell in row:
        if cell.row == 7:
            if cell.column == 1:
                cell.fill = PatternFill(start_color="DBF0AF",fill_type="solid")
        else:
            if cell.column == 1:
                cell.number_format = numbers.FORMAT_CURRENCY_USD_SIMPLE

# wb.save('Excel_Report_Generator.xlsx')

So far, our excel sheet looks like this,

![Image-1](Images/image1.png)

Similarly, we'll use the same method to insert the *'weekly sales data'*.

In [33]:
ws.row_dimensions[10].height = 35
ws.row_dimensions[11].height = 35
ws.row_dimensions[12].height = 35

#Adding data vertically for temporary use
rows_temp = dataframe_to_rows(df_week,index=False)
add_df_to_excel(ws,rows_temp,11,10,isHidden=True)

ws.merge_cells('A10:C10')
merged_cell = ws['A10']
merged_cell.alignment = Alignment(horizontal='left',vertical='center')
merged_cell.value = 'WEEKLY SALES REPORT'
merged_cell.font = Font('Century Gothic',bold=False,size=20,color='548235')

rows_week = dataframe_to_rows(weekly_sales,index=False)
add_df_to_excel(ws,rows_week,11,1,isHidden=False)

for row in ws.iter_rows(min_row=11,max_row=12,min_col=1,max_col=len(weekly_sales.columns)):
    for cell in row:
        if cell.row == 12:
            cell.number_format = numbers.FORMAT_CURRENCY_USD_SIMPLE
        

# wb.save('Excel_Report_Generator.xlsx')

![Image-2](Images/image2.png)

# Adding DoughnutChart to Excel

Now, Let's add the Bar chart for the revenue generated weekly in the month. For that we'll use <span style="color:red">DoughnutChart</span> in **openpyxl**
library.

In [34]:
from openpyxl.chart import DoughnutChart,Reference
from openpyxl.chart.label import DataLabelList

ws.row_dimensions[14].height = 100
ws.row_dimensions[15].height = 100
ws.row_dimensions[16].height = 74.25

weekly_chart = DoughnutChart()
weekly_chart.title = "Weekly Revenue"
weekly_chart.height = 10
weekly_chart.widht = 25

#Data and Categories
data_week = Reference(ws,min_col=11,min_row=11,max_row=11 + len(df_week))
category_week = Reference(ws,min_col=10,min_row=12,max_row=11 + len(df_week))
weekly_chart.add_data(data_week,titles_from_data=True)
weekly_chart.set_categories(category_week)

#Add Chart Labels
weekly_chart.dataLabels = DataLabelList()
weekly_chart.dataLabels.showVal = False
weekly_chart.dataLabels.showPercent = True

ws.add_chart(weekly_chart,'A14')

# wb.save('Excel_Report_Generator.xlsx')

![Image-3](Images/image3.png)

Here, You can see the DoughnutChart is created from the weekly sales data.

# Sales By Product

Now, we'll add the data of revenue generated by each product.

In [35]:
product_sales

            Product  Units Sold  Unit Price  Revenue
0     Action Figure         380          30    11400
1   Air Conditioner         331         399   132069
2           Blender         572          89    50908
3        Board Game         537          40    21480
4            Jacket         460          75    34500
5             Jeans         443          50    22150
6            Laptop         430         999   429570
7         Microwave         487         150    73050
8            Puzzle         466          20     9320
9        Smartphone         410         699   286590
10          T-shirt         395          25     9875
11           Tablet         514         499   256486

Let's add this data to the exel using the same method we used above.

In [36]:
ws.row_dimensions[19].height = 35
ws.merge_cells('A19:C19')
merged_cell = ws['A19']
merged_cell.alignment = Alignment(horizontal='left',vertical='center')
merged_cell.value = 'SALES BY PRODUCT'
merged_cell.font = Font('Century Gothic',bold=False,size=20,color='548235')

rows_product = dataframe_to_rows(product_sales,index=False)
add_df_to_excel(ws,rows_product,21,1,isHidden=False)

# wb.save('Excel_Report_Generator.xlsx')

![Image-4](Images/image4.png)

# Adding BarChart to Excel

Now, using the **BarChart**, we'll create the barchart of the sales of different products.

In [37]:
from openpyxl.chart import BarChart

product_chart = BarChart()
product_chart.type = "bar"
product_chart.title = "Sales by Product"
product_chart.style = 5
product_chart.y_axis.title = "Revenue"
product_chart.x_axis.title = "Product"
product_chart.height = 20
product_chart.width = 35

data = Reference(ws,min_col=4,max_col=len(product_sales.columns),min_row=21,max_row=21+len(product_sales))
cat = Reference(ws,min_col=1,min_row=22,max_row=21+len(product_sales))
product_chart.add_data(data,titles_from_data=True)
product_chart.set_categories(cat)

#Add Chart Labels
product_chart.legend = None
product_chart.dataLabels = DataLabelList()
product_chart.dataLabels.showVal = True

ws.add_chart(product_chart,'A35')
ws.sheet_view.showGridLines = False

# wb.save('Excel_Report_Generator.xlsx')

![Image-5](Images/image5.png)

# Sales by Category

similarly, let's add the sales data of different categories.

In [38]:
category_sales

          Category  Units Sold  Unit Price  Revenue
0         Clothing        1298          75    66525
1      Electronics        1354         499   972646
2  Home Appliances        1390         150   256027
3             Toys        1383          30    42200

In [39]:
ws.row_dimensions[74].height = 35
ws.merge_cells('A74:C74')
merged_cell = ws['A74']
merged_cell.alignment = Alignment(horizontal='left',vertical='center')
merged_cell.value = 'SALES BY CATEGORY'
merged_cell.font = Font('Century Gothic',bold=False,size=20,color='548235')

rows_category = dataframe_to_rows(category_sales,index=False)
add_df_to_excel(ws,rows_category,76,1,isHidden=False)

In [40]:
category_chart = BarChart()
category_chart.type = "bar"
category_chart.title = "Sales by Category"
category_chart.style = 5
category_chart.y_axis.title = "Revenue"
category_chart.x_axis.title = "Category"
category_chart.height = 12
category_chart.width = 25

data_cat = Reference(ws,min_col=4,max_col=len(category_sales.columns),min_row=76,max_row=76+len(category_sales))
cat_labels = Reference(ws,min_col=1,min_row=77,max_row=76+len(category_sales))
category_chart.add_data(data_cat,titles_from_data=True)
category_chart.set_categories(cat_labels)

#Add Chart Labels
category_chart.legend = None
category_chart.dataLabels = DataLabelList()
category_chart.dataLabels.showVal = True

ws.add_chart(category_chart,'A82')

# wb.save('Excel_Report_Generator.xlsx')

![Image-6](Images/image6.png)

# Sales By Region

Similarly, Also let's add the revenue generated by different regions in the excel report.

In [41]:
region_sales

  Region  Units Sold  Unit Price  Revenue
0   East        1543          40   402162
1  North        1305         499   270592
2  South        1181         150   298314
3   West        1396          25   366330

In [42]:
ws.row_dimensions[106].height = 35
ws.merge_cells('A106:C106')
merged_cell = ws['A106']
merged_cell.alignment = Alignment(horizontal='left',vertical='center')
merged_cell.value = 'SALES BY REGION'
merged_cell.font = Font('Century Gothic',bold=False,size=20,color='548235')

rows_region = dataframe_to_rows(region_sales,index=False)
add_df_to_excel(ws,rows_region,108,1,isHidden=False)

In [43]:
region_chart = BarChart()
region_chart.type = "bar"
region_chart.title = "Sales by Region"
region_chart.style = 5
region_chart.y_axis.title = "Revenue"
region_chart.x_axis.title = "Region"
region_chart.height = 12
region_chart.width = 25

data_cat = Reference(ws,min_col=4,max_col=len(region_sales.columns),min_row=108,max_row=108+len(region_sales))
cat_labels = Reference(ws,min_col=1,min_row=109,max_row=108+len(region_sales))
region_chart.add_data(data_cat,titles_from_data=True)
region_chart.set_categories(cat_labels)

#Add Chart Labels
region_chart.legend = None
region_chart.dataLabels = DataLabelList()
region_chart.dataLabels.showVal = True

ws.add_chart(region_chart,'A115')

wb.save('Excel_Report_Generator.xlsx')

![Image-7](Images/image7.png)

<h1 style="font-size:50px; color:Green"><center>Thank You</center></h1>